#pragma once

#include "Game/Sprite/Sprite.h"

class TextSprite : public Sprite {
public:
	TextSprite(const fileUtils::path& file, Scene* scene, SDL_FRect transform, SDL_FRect subTexture = { -1, -1, -1, -1 });
	void draw(int zIndex = 0) {};
	void drawText(char c) override;

private:
	std::vector<std::string> m_fontChars = {
		" ", "!", "\"", "#", "$", "%", "&", "'", "(", ")", "*",  "+", ",", "-", ".", "/",
		"0", "1",  "2", "3", "4", "5", "6", "7", "8", "9", ":",  ";", "=", "?", "@", "A",
		"B", "C",  "D", "E", "F", "G", "H", "I", "J", "K", "L",  "M", "N", "O", "P", "Q",
		"R", "S",  "T", "U", "V", "W", "X", "Y", "Z", "[", "\\", "]", "^", "_", "a", "b",
		"c", "d",  "e", "f", "g", "h", "i", "j", "k", "l", "m",  "n", "o", "p", "q", "r",
		"s", "t",  "u", "v", "w", "x", "y", "z", "€", "‚", "„",  "<", "Œ", "‘", "’", "“",
		"”", ">",  "œ", "¡", "£", "ᵃ", "«", "ᵉ", "ʳ", "²", "³",  "°", "ᵒ", "»", "¿", "À",
		"Á", "Â",  "Ã", "Ä", "Å", "Ç", "È", "É", "Ê", "Ë", "Ì",  "Í", "Î", "Ï", "Ñ", "Ò",
		"Ó", "Ô",  "Ö", "Ù", "Ú", "Û", "Ü", "ß", "à", "á", "â",  "ä", "ç", "è", "é", "ê",
		"ë", "ì",  "í", "î", "ñ", "ò", "ó", "ô", "ö", "ù", "ú",  "û", "ü"
	};
};
